{
    "id": "",
    "slug": "how-to-ruin-a-first-date",
    "title": "How To Ruin A First Date!",
    "author": "Manogna Bedhu",
    "category": "",
    "summary": "Navigating the dating scene is like navigating a landmine  — there’s really no reason to root for anything to blow up! Thankfully, Indigo Magazine is here to save the day and ease your nerves. Taken from real stories, here are 4 outrageous anecdotes of love mishaps, so you can get ever closer to cutting the right wire while keeping all parts of you and your partner intact.",
    "date": "February 19, 2026",
    "layout": "valentine",
    "content": [
        {
            "type": "text",
            "value": "Navigating the dating scene is like navigating a landmine — there’s really no reason to root for anything to blow up! Thankfully, Indigo Magazine is here to save the day and ease your nerves. Taken from real stories, here are 4 outrageous anecdotes of love mishaps, so you can get ever closer to cutting the right wire while keeping all parts of you and your partner intact."
        },
        {
            "type": "heading",
            "value": "“Let Love Affairs Be…If They’re With Fashion”"
        },
        {
            "type": "text",
            "value": "A lover is a sight for sore eyes, but it’s best to leave it at that, rather than risk souring both eyes and moods. One unfortunate woman informs us that her one-date-wonder grabbed her sweater and pulled on it with a grimace, promptly making a bad situation worse by commenting, “Your sweater looks like it has a lot of microplastics, let me buy you a new one.”"
        },
        {
            "type": "text",
            "value": "Oh, buddy….At least buy her dinner first!"
        },
        {
            "type": "heading",
            "value": "“Maybe Make Sure You Know Where She’s Sitting”"
        },
        {
            "type": "text",
            "value": "Ahh…The Prodigal dinner and a movie. A classic first date since the first camera captured a moving train. But keep your flashlights close. One man warns us that when he left his date in front of the silver screen for the porcelain throne, it wasn’t until he returned, took his seat, and watched till end credits that he realized he was sitting next to the wrong girl!"
        },
        {
            "type": "text",
            "value": "Talk about being blinded by the light."
        },
        {
            "type": "heading",
            "value": "“Leave the Tokyo Drifting To Those Equipped For It”"
        },
        {
            "type": "text",
            "value": "Every kid dreams of being the coolest guy on the road— tires screeching, pedal to the metal —but leave those dreams to your six year old self. A traumatized passenger prince lets us know that his date chose to ram past a red light in a rush to make reservations…and promptly ate metal when a car slammed into them in the process. Ladies, gentlemen, and everyone in between, repeat after me:"
        },
        {
            "type": "text",
            "value": "You may be your monarch of your date’s heart, but you are no Lightning McQueen."
        },
        {
            "type": "heading",
            "value": "“Eat And Tell !!!”"
        },
        {
            "type": "text",
            "value": "The covetous first kiss, as you walk your date to the door and they shyly turn around with a glimmer in their eye is a staple of romcoms everywhere. Not for this unfortunate lip-locker, when their date decided that the perfect kiss was made when he was still *chewing on dessert.*"
        },
        {
            "type": "text",
            "value": "Take it slow, before you choke on both food and rejection!"
        },
        {
            "type": "text",
            "value": "In the end, the best advice is that you’re both in it together. The nerves jittering through you are the very same jittering through the darling of your dreams…And I’ve got a thousand years of human biology to prove it!"
        },
        {
            "type": "text",
            "value": "Make a move, put on your best perfume, and seize the day in the name of love!"
        }
    ]
}